{
  "backend/main.mo": "Motoko actor implementing a VAT rate registry with owner-based access control and API key management, exposing functions to add owners, upsert/list VAT rates, and add/remove/check API keys.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (Transaction tab line items entry, passing line items to Invoice tab, replacing Invoice item type dropdown with read-only text) to their source files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summary document listing short descriptions of each frontend source file for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the Glotaxa React SPA, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root app component managing shared state (selectedCountry, calculationData, lineItems) and rendering a four-tab layout (Country, Transaction, Invoice, API Docs) with Header and Footer.",
  "frontend/src/components/CompliancePanel.tsx": "UI panel component displaying VAT rate, VAT type, a scored compliance meter with progress bar, and a list of compliance warnings using shadcn Card and Badge components.",
  "frontend/src/components/FeaturesSection.tsx": "Empty file placeholder for the FeaturesSection component.",
  "frontend/src/components/Footer.tsx": "Footer component showing copyright year, a caffeine.ai attribution link with UTM tracking, and a VAT disclaimer notice.",
  "frontend/src/components/Header.tsx": "Sticky header component rendering the Glotaxa brand name alongside a gradient calculator icon.",
  "frontend/src/components/Hero.tsx": "Empty file placeholder for the Hero component.",
  "frontend/src/components/InvoiceCalculator.tsx": "Empty file placeholder for the InvoiceCalculator component.",
  "frontend/src/components/InvoiceView.tsx": "Empty file placeholder for the InvoiceView component.",
  "frontend/src/components/RegionSelector.tsx": "Empty file placeholder for the RegionSelector component.",
  "frontend/src/components/TabbedInterface.tsx": "Empty file placeholder for the TabbedInterface component.",
  "frontend/src/config/vatConfig.ts": "Empty file placeholder for the VAT configuration module.",
  "frontend/src/constants/productCategories.ts": "Empty file placeholder for the product categories constants.",
  "frontend/src/constants/vatCategories.ts": "Empty file placeholder for the VAT categories constants.",
  "frontend/src/data/vatRules.ts": "Defines the CountryCode union type and VAT_RULES record mapping 11 country codes (EU + GB) to their standard, reduced, and optional super-reduced VAT rates.",
  "frontend/src/engine/vatEngine.ts": "Implements VAT calculation logic including OSS detection, reverse charge, exempt categories, zero-rated, and reduced/standard rate rules for EU and UK countries.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both authenticated and anonymous identities, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions and identity state to child components.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities, defines light and dark theme CSS custom properties, and applies z-index fixes for dropdown/select components.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/ApiDocs.tsx": "Renders a documentation page for the VAT Calculation API, showing endpoint details, request/response parameters, and code examples for OSS and reverse charge scenarios.",
  "frontend/src/pages/Invoice.tsx": "Invoice generation page that collects seller/buyer details and line items, computes VAT per line using country rules, and supports exporting the invoice as PDF or XML.",
  "frontend/src/pages/LandingPage.tsx": "Renders the Glotaxa marketing landing page with a hero section, feature grid (multi-country VAT, compliant invoices, PDF export, etc.), and a 'Get Started' button that triggers the app entry point.",
  "frontend/src/pages/RegionSelect.tsx": "Displays a country selection UI split into EU member states and UK, allowing the user to pick a country for VAT calculation.",
  "frontend/src/pages/Transaction.tsx": "Main transaction form page where users configure supplier/buyer countries, buyer type, VAT category, net amount, and line items; computes VAT in real-time and shows compliance score and risk warnings.",
  "frontend/src/types/invoice.ts": "Defines TypeScript interfaces for an EN 16931-compliant invoice, including header, seller/buyer details, line items, payment terms, and the top-level Invoice16931 structure.",
  "frontend/src/utils/complianceScoreCalculator.ts": "Calculates a 0–100 compliance score for a transaction by deducting points for missing VAT ID, invoice number, category, or reverse-charge note on cross-border deals.",
  "frontend/src/utils/invoicePDF.ts": "Generates a styled HTML invoice document from an Invoice16931 object and triggers a browser print/download as a PDF.",
  "frontend/src/utils/invoiceXML.ts": "Serializes an Invoice16931 object into a UBL 2.x XML string conforming to the EN 16931 e-invoicing standard.",
  "frontend/src/utils/riskDetector.ts": "Detects VAT compliance risks such as potential OSS registration requirements for cross-border B2C sales or reduced-rate eligibility checks, returning an array of warning strings.",
  "frontend/src/utils/vatEngine.ts": "Empty file with no content.",
  "frontend/src/utils/vatLogicExplainer.ts": "Generates a human-readable, multi-section text explanation of a VAT decision given transaction inputs (seller/buyer country, buyer type, category, rate, VAT type, OSS status, compliance score, and risks). Covers why the VAT rule applies, invoice compliance status, OSS registration obligations, and actionable next steps.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, content paths, custom OKLCH-based color tokens, border radius, box shadow, accordion keyframe animations, and Inter as the default sans-serif font. Includes the typography, container-queries, and tailwindcss-animate plugins.",
  "project_state.json": "Tracks the current project state (version 3) for a financial app featuring Transaction and Invoice tabs, documenting existing features (up to 3 line items per invoice with VAT category/rate flow-through and removal of the item-type dropdown) and pending new feature requests. Serves as a structured changelog and architectural reference for the build."
}