{
  "backend/main.mo": "Motoko actor implementing a VAT rate registry with owner-based access control, API key management, and VAT calculation. Owners can upsert VAT rates, manage API keys, and add new owners; any caller can compute VAT for a given amount and key.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—'Generate Invoice' button pre-populating the Invoice tab and 'Back' navigation buttons on each tab—to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document providing short descriptions of every frontend source file, serving as a reference index for the project's components, utilities, configs, and types.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React root into a div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component managing active tab state, selected country, and invoice pre-population data, wiring together RegionSelect, Transaction, Invoice, and ApiDocs pages with a sticky tab navigation bar.",
  "frontend/src/components/CompliancePanel.tsx": "UI panel component displaying VAT transaction results, a scored compliance indicator with progress bar, and a list of compliance warnings using shadcn Card, Badge, and Alert primitives.",
  "frontend/src/components/FeaturesSection.tsx": "Empty file placeholder for the FeaturesSection component (no content present).",
  "frontend/src/components/Footer.tsx": "Footer component rendering a copyright notice, a caffeine.ai attribution link with UTM parameters, and a VAT disclaimer.",
  "frontend/src/components/Header.tsx": "Sticky header component displaying the Glotaxa brand name alongside a gradient calculator icon.",
  "frontend/src/components/Hero.tsx": "Empty file placeholder for the Hero section component (no content present).",
  "frontend/src/components/InvoiceCalculator.tsx": "Empty file placeholder for the InvoiceCalculator component (no content present).",
  "frontend/src/components/InvoiceView.tsx": "Empty file placeholder for the InvoiceView component (no content present).",
  "frontend/src/components/RegionSelector.tsx": "Empty file placeholder for the RegionSelector component (no content present).",
  "frontend/src/components/TabbedInterface.tsx": "Empty file placeholder for the TabbedInterface component (no content present).",
  "frontend/src/config/vatConfig.ts": "Empty file placeholder for the VAT configuration module (no content present).",
  "frontend/src/constants/productCategories.ts": "Empty file placeholder for the product categories constants (no content present).",
  "frontend/src/constants/vatCategories.ts": "Empty file placeholder for the VAT categories constants (no content present).",
  "frontend/src/data/vatRules.ts": "Defines the CountryCode union type and VAT_RULES record containing standard, reduced, and optional super-reduced VAT rates for 11 supported countries (EU members plus GB).",
  "frontend/src/engine/vatEngine.ts": "Implements VAT calculation logic including OSS detection, reverse charge, exempt categories, zero-rated, and reduced/standard rate rules for multiple EU countries and GB.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines light/dark CSS custom properties for the design system, and applies z-index fixes for dropdown/select components.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query and InternetIdentityProvider providers.",
  "frontend/src/pages/ApiDocs.tsx": "Static documentation page describing the VAT Calculation REST API endpoint, its request parameters, and usage details.",
  "frontend/src/pages/Invoice.tsx": "Invoice builder page that manages seller/buyer details, line items with VAT categories, and supports exporting invoices as PDF or EN 16931-compliant XML.",
  "frontend/src/pages/LandingPage.tsx": "Renders the Glotaxa marketing landing page with a hero section, feature grid (multi-country VAT, compliant invoices, PDF export, etc.), and a 'Get Started' button that triggers the app entry point.",
  "frontend/src/pages/RegionSelect.tsx": "Displays a country selection UI listing 10 EU countries and the UK, allowing the user to pick a seller country to proceed with VAT calculations.",
  "frontend/src/pages/Transaction.tsx": "Provides a transaction form where users input buyer type, buyer country, product category, and net amount, then calculates VAT, shows compliance score and risk warnings, and allows navigating to invoice generation.",
  "frontend/src/types/invoice.ts": "Defines TypeScript interfaces for an EN 16931-compliant invoice, including header, seller/buyer details, line items, payment terms, and the top-level Invoice16931 structure.",
  "frontend/src/utils/complianceScoreCalculator.ts": "Calculates a compliance score (0–100) for a transaction by deducting points for missing VAT ID, invoice number, category, or reverse charge note on cross-border B2B transactions.",
  "frontend/src/utils/invoicePDF.ts": "Generates and downloads an HTML-based invoice as a printable PDF by constructing a full HTML document with styled tables for line items, VAT breakdown, and totals from an Invoice16931 object.",
  "frontend/src/utils/invoiceXML.ts": "Generates a UBL 2.x XML string conforming to the EN 16931 standard from an Invoice16931 object, including seller/buyer parties, line items, tax subtotals, and payment means.",
  "frontend/src/utils/riskDetector.ts": "Detects VAT compliance risks such as potential OSS registration requirements for cross-border B2C transactions and flags reduced-rate eligibility for verification.",
  "frontend/src/utils/vatEngine.ts": "Empty file with no content.",
  "frontend/src/utils/vatLogicExplainer.ts": "Generates a human-readable, multi-section text explanation of a VAT decision based on inputs like seller/buyer country, buyer type, VAT type, compliance score, and risks. Covers why a VAT rule applies, invoice compliance status, and OSS registration obligations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens using OKLCH variables, border radius, animations, font family, and plugins (typography, container-queries, animate).",
  "project_state.json": "Tracks the project state for a VAT/Invoice management app, recording existing features (Generate Invoice button, Back button navigation), pending feature requests, architectural notes, and project metadata."
}