{
  "backend/main.mo": "Motoko actor implementing a VAT rate registry with owner-based access control and API key management, exposing functions to add owners, upsert/list VAT rates, and add/remove/check API keys.",
  "feature_evidence.json": "Feature evidence report describing two tasks: moving the 'Most Popular for Freelancers' badge and the 'Best Value' badge inside their respective plan columns in the Pricing page.",
  "frontend-file-summaries.txt": "Truncated JSON document summarizing each frontend source file's purpose, covering components, pages, utilities, config, and type definitions for the Glotaxa VAT calculator app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the Glotaxa React SPA, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing five-tab navigation (Select Region, Transaction, Invoice, API Docs, Pricing), shared country and invoice pre-population state, and rendering all page components.",
  "frontend/src/components/CompliancePanel.tsx": "Compliance panel component displaying the applied VAT rate, VAT type badge, a scored compliance meter with progress bar, and a list of compliance warnings.",
  "frontend/src/components/FeaturesSection.tsx": "Empty file placeholder for the FeaturesSection component.",
  "frontend/src/components/Footer.tsx": "Footer component showing copyright year, a caffeine.ai attribution link with UTM tracking, and a VAT disclaimer note.",
  "frontend/src/components/Header.tsx": "Sticky header component rendering the Glotaxa brand name alongside a gradient calculator icon.",
  "frontend/src/components/Hero.tsx": "Empty file placeholder for the Hero section component.",
  "frontend/src/components/InvoiceCalculator.tsx": "Empty file placeholder for the InvoiceCalculator component.",
  "frontend/src/components/InvoiceView.tsx": "Empty file placeholder for the InvoiceView component.",
  "frontend/src/components/RegionSelector.tsx": "Empty file placeholder for the RegionSelector component.",
  "frontend/src/components/TabbedInterface.tsx": "Empty file placeholder for the TabbedInterface component.",
  "frontend/src/components/TransportVatModal.tsx": "Modal dialog explaining UK transport VAT split rates: 0% for public bus/train services and 20% standard rate for taxis and car hire, with a default-to-20% note.",
  "frontend/src/config/vatConfig.ts": "Empty file placeholder for the VAT configuration module.",
  "frontend/src/constants/productCategories.ts": "Empty file placeholder for the product categories constants.",
  "frontend/src/constants/vatCategories.ts": "Empty file placeholder for the VAT categories constants.",
  "frontend/src/data/vatRules.ts": "Defines VAT rate configurations for 11 countries (EU + GB), including standard, reduced, and super-reduced rates, plus UK-specific category-level overrides for zero-rated, exempt, and reverse-charge scenarios.",
  "frontend/src/engine/vatEngine.ts": "Implements VAT calculation logic including OSS detection for cross-border EU B2C transactions, UK-specific category rules, and returns a structured result with rate, type, amount, and category.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, switching between anonymous and authenticated actors based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component, exposing login/logout functions, identity state, and login status via a React context backed by the DFINITY AuthClient.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light and dark theme tokens, and includes z-index fixes for dropdown/select components.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/ApiDocs.tsx": "Renders a documentation page for the VAT Calculation REST API, displaying the endpoint, request parameters table, and navigation back to the invoice tab.",
  "frontend/src/pages/Invoice.tsx": "Invoice creation page that lets users fill in seller/buyer details, add line items, and download the invoice as PDF or UBL-XML, with VAT rates resolved per country and category using vatRules data.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page for Glotaxa displaying a hero section, feature grid, and a 'Get Started' button that triggers the app entry point.",
  "frontend/src/pages/Pricing.tsx": "Pricing page that renders four subscription plan cards (Free, Starter, Pro, Business) with features, limits, and upgrade buttons.",
  "frontend/src/pages/RegionSelect.tsx": "Country selection page listing 10 EU countries and the UK as clickable cards, allowing the user to pick a seller country before proceeding.",
  "frontend/src/pages/Transaction.tsx": "VAT transaction calculator page where users configure buyer type, countries, category, and net amount to compute VAT, compliance score, and risk warnings, with an option to pre-populate the invoice page.",
  "frontend/src/types/invoice.ts": "TypeScript type definitions for EN 16931-compliant invoice data structures including header, seller, buyer, line items, payment terms, and the top-level Invoice16931 interface.",
  "frontend/src/utils/complianceScoreCalculator.ts": "Utility that calculates a compliance score (0–100) for a VAT transaction by deducting points for missing VAT ID, invoice number, category, or reverse charge note.",
  "frontend/src/utils/invoicePDF.ts": "Generates and downloads a styled HTML invoice as a printable PDF by building an HTML document from an Invoice16931 object, including line items, VAT breakdown, and totals.",
  "frontend/src/utils/invoiceXML.ts": "Generates a UBL 2.x-compliant EN 16931 XML invoice string from an Invoice16931 object, including seller/buyer parties, tax subtotals, and invoice lines.",
  "frontend/src/utils/riskDetector.ts": "Detects VAT compliance risks (e.g., OSS registration requirement, reduced rate eligibility) based on seller/buyer country, buyer type, and VAT category.",
  "frontend/src/utils/vatEngine.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/vatLogicExplainer.ts": "Produces a detailed human-readable explanation of a VAT decision (OSS, Reverse Charge, Exempt, Zero Rated, etc.) based on seller/buyer countries, transaction category, and compliance metadata.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens (colors via oklch, border radius, shadows, animations, fonts) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state for a fix request to move the 'Most Popular for Freelancers' and 'Best Value' badges inside their respective plan columns on the Pricing page."
}