{
  "backend/main.mo": "Motoko actor implementing a VAT rate registry with owner-based access control, API key management, and VAT calculation. Owners can upsert VAT rates and manage API keys; any caller can compute VAT amounts.",
  "feature_evidence.json": "Feature evidence report documenting that Invoice.tsx enforces a maximum of 3 line items per invoice by disabling or hiding the 'Add Line Item' button when the limit is reached.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing each component's purpose and key functionality for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the Glotaxa React app, mounting the root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component managing tab navigation across four pages (RegionSelect, Transaction, Invoice, ApiDocs) and sharing selected country and invoice pre-population state between them.",
  "frontend/src/components/CompliancePanel.tsx": "React component rendering a compliance sidebar with VAT rate/type result, a scored progress bar with color-coded badge, and a list of compliance warnings.",
  "frontend/src/components/FeaturesSection.tsx": "Empty file placeholder for the FeaturesSection component.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year, a caffeine.ai attribution link with UTM parameters, and a VAT disclaimer notice.",
  "frontend/src/components/Header.tsx": "Sticky header component showing the Glotaxa brand name alongside a gradient calculator icon.",
  "frontend/src/components/Hero.tsx": "Empty file placeholder for the Hero section component.",
  "frontend/src/components/InvoiceCalculator.tsx": "Empty file placeholder for the InvoiceCalculator component.",
  "frontend/src/components/InvoiceView.tsx": "Empty file placeholder for the InvoiceView component.",
  "frontend/src/components/RegionSelector.tsx": "Empty file placeholder for the RegionSelector component.",
  "frontend/src/components/TabbedInterface.tsx": "Empty file placeholder for the TabbedInterface component.",
  "frontend/src/components/TransportVatModal.tsx": "Modal dialog explaining UK transport VAT split rates: 0% for public bus/train services and 20% standard rate for taxis and car hire, with a default-to-20% note.",
  "frontend/src/config/vatConfig.ts": "Empty file placeholder for the VAT configuration module.",
  "frontend/src/constants/productCategories.ts": "Empty file placeholder for the product categories constants.",
  "frontend/src/constants/vatCategories.ts": "Empty file placeholder for the VAT categories constants.",
  "frontend/src/data/vatRules.ts": "Defines VAT rate configurations for 11 countries (EU + GB), including standard, reduced, and super-reduced rates, with special category-level overrides for the UK (zero-rated, exempt, reverse charge, etc.).",
  "frontend/src/engine/vatEngine.ts": "Implements the VAT calculation engine, including OSS detection for cross-border EU B2C transactions and country/category-specific rate logic (with detailed UK handling), returning a structured VATCalculationResult.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, switching between anonymous and authenticated actors based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for React, exposing login/logout functions, identity state, and login status via a custom hook backed by DFINITY's AuthClient.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark CSS custom properties for the design system, and includes z-index fixes for dropdown/select components.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/ApiDocs.tsx": "A documentation page component that displays the VAT Calculation REST API reference, including the endpoint, request parameters table, and navigation back to the invoice tab.",
  "frontend/src/pages/Invoice.tsx": "Invoice creation page that allows users to fill in seller/buyer details, add line items with VAT categories, and download the invoice as PDF or XML. Includes VAT rate resolution logic per country and category.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page for Glotaxa that displays a hero section, feature grid, and a 'Get Started' button to enter the app.",
  "frontend/src/pages/RegionSelect.tsx": "Country selection page listing 10 EU countries and the UK as clickable cards, allowing the user to pick a seller country before proceeding.",
  "frontend/src/pages/Transaction.tsx": "VAT transaction calculator page where users configure buyer type, country, category, and net amount to compute VAT, compliance score, and risk warnings, with an option to generate an invoice.",
  "frontend/src/types/invoice.ts": "TypeScript type definitions for EN 16931-compliant invoice data structures, including header, seller, buyer, line items, payment terms, and the top-level Invoice16931 interface.",
  "frontend/src/utils/complianceScoreCalculator.ts": "Calculates a compliance score (0–100) for a VAT transaction by deducting points for missing VAT ID, invoice number, category, or reverse charge note.",
  "frontend/src/utils/invoicePDF.ts": "Generates and triggers a browser print/download of an Invoice16931 as a styled HTML document rendered in a new window.",
  "frontend/src/utils/invoiceXML.ts": "Generates a UBL 2.1 / EN 16931-compliant XML string from an Invoice16931 object, including seller/buyer parties, line items, tax subtotals, and payment means.",
  "frontend/src/utils/riskDetector.ts": "Analyzes a transaction's seller/buyer countries, buyer type, and VAT category to return an array of compliance risk warning strings (e.g., OSS registration, reduced-rate eligibility).",
  "frontend/src/utils/vatEngine.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/vatLogicExplainer.ts": "Produces a detailed human-readable explanation of why a specific VAT rule (OSS, Reverse Charge, Exempt, Zero Rated, etc.) applies to a transaction, covering EU and UK scenarios.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radii, accordion keyframes, Inter font, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the Glotaxa project's versioned state, existing features, and pending feature requests, including the enforced 3-line-item maximum on the Invoice tab."
}