{
  "kind": "build_request",
  "title": "Add Generate Invoice Button and Back Navigation Across All Tabs",
  "projectName": "Glotaxa VAT",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a 'Generate Invoice' button in the VAT Calculation Summary column on the Transaction tab. When clicked, it should pre-populate the Invoice tab with data from the current transaction (country, VAT rate, VAT type, net amount, gross amount, buyer type, and category), then navigate the user to the Invoice tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a Generate Invoice Button on the VAT Calculation Summary Column. so that information from the Transaction tab flows into Invoice tab"
        ]
      },
      "acceptanceCriteria": [
        "A 'Generate Invoice' button is visible in the VAT Calculation Summary column on the Transaction tab.",
        "Clicking the button transfers transaction data (country, VAT rate, VAT type, amounts, buyer type, category) into the Invoice tab form fields.",
        "The app navigates to the Invoice tab after clicking the button.",
        "If no VAT calculation has been performed yet, the button is disabled or shows a tooltip prompting the user to complete the calculation first."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a 'Back' button on each tab (RegionSelect/Country, Transaction, Invoice, API Docs) that navigates the user to the previous screen, allowing them to make changes. The back button on the first screen (Country/RegionSelect) should be hidden or disabled since there is no prior screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "In all the tabs, add a back button so that user can make changes in the previous screens"
        ]
      },
      "acceptanceCriteria": [
        "A 'Back' button is visible on the Transaction tab and navigates to the Country/RegionSelect tab.",
        "A 'Back' button is visible on the Invoice tab and navigates to the Transaction tab.",
        "A 'Back' button is visible on the API Docs tab and navigates to the Invoice tab.",
        "The Country/RegionSelect tab either hides the Back button or shows it as disabled since it is the first screen.",
        "Navigating back preserves any previously entered data in the tab being returned to."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ or frontend/src/components/ui/.",
    "All state sharing between Transaction and Invoice tabs must go through the existing shared state mechanism in App.tsx.",
    "Back navigation must use the existing tab-switching mechanism in App.tsx rather than browser history."
  ],
  "nonGoals": [
    "Changing the backend schema or VAT rate logic.",
    "Adding new tabs or pages beyond the existing four.",
    "Implementing browser history-based routing (e.g., React Router).",
    "Resetting form state when navigating back between tabs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}