{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Pricing Tab Badge Placement — Move Labels Inside Plan Columns",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Move the 'Most Popular for Freelancers' badge inside the Starter plan card boundaries",
      "acceptanceCriteria": [
        "The 'Most Popular for Freelancers' label/badge is visually contained within the Starter plan card boundaries.",
        "The badge does not overlap with adjacent plan columns.",
        "The Starter card layout remains consistent and readable on desktop and mobile viewports."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Pricing.tsx",
          "operation": "modify",
          "description": "Relocate the 'Most Popular for Freelancers' badge from its current position (likely above or outside the Starter card) to inside the Starter plan column. Position it as an inline element within the card, such as above the plan title or as a chip component within the card header. Ensure the badge styling (background, padding, text) is preserved and the card layout accommodates the badge without breaking responsive behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Move the 'Best Value' badge inside the Pro plan card boundaries",
      "acceptanceCriteria": [
        "The 'Best Value' label/badge is visually contained within the Pro plan card boundaries.",
        "The badge does not overlap with adjacent plan columns.",
        "The Pro card layout remains consistent and readable on desktop and mobile viewports."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Pricing.tsx",
          "operation": "modify",
          "description": "Relocate the 'Best Value' label/badge from its current position (likely above or outside the Pro card) to inside the Pro plan column. Position it as an inline element within the card, such as above the plan title or as a chip component within the card header. Ensure the badge styling (background, padding, text) is preserved and the card layout accommodates the badge without breaking responsive behavior."
        }
      ]
    }
  ]
}