{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two CSS fixes for VAT Category dropdown visibility issues: applying z-index and overflow fixes to index.css, and limiting dropdown to 3 visible items with scrolling in Transaction.tsx.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, utilities, types, and configuration files for the Glotaxa VAT calculator application.",
  "frontend/index.css": "Global Tailwind CSS file defining OKLCH color system variables for light and dark modes, with base styles for borders and background/foreground colors.",
  "frontend/index.html": "HTML entry point for the Glotaxa application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component managing three-tab interface (Country Selection, Transaction, Invoice) with state flow from country selection through VAT calculation to invoice generation.",
  "frontend/src/components/FeaturesSection.tsx": "Empty file placeholder for features section component.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, caffeine.ai attribution with UTM tracking, and VAT calculation disclaimer.",
  "frontend/src/components/Header.tsx": "Sticky header component displaying Glotaxa brand with calculator icon and gradient background.",
  "frontend/src/components/Hero.tsx": "Empty file placeholder for hero section component.",
  "frontend/src/components/InvoiceCalculator.tsx": "Empty file placeholder for invoice calculator component.",
  "frontend/src/components/InvoiceView.tsx": "Empty file placeholder for invoice view component.",
  "frontend/src/components/RegionSelector.tsx": "Empty file placeholder for region selector component.",
  "frontend/src/components/TabbedInterface.tsx": "Empty file placeholder for tabbed interface component.",
  "frontend/src/config/vatConfig.ts": "Empty file placeholder for VAT configuration.",
  "frontend/src/constants/productCategories.ts": "Empty file placeholder for product categories constants.",
  "frontend/src/constants/vatCategories.ts": "Empty file placeholder for VAT categories constants.",
  "frontend/src/data/vatRules.ts": "VAT rules configuration defining CountryCode type and VAT_RULES object with standard, reduced, and optional super-reduced rates for 11 EU countries plus UK.",
  "frontend/src/engine/vatEngine.ts": "VAT calculation engine implementing calculateVAT function with logic for reverse charge, exempt, zero-rated, reduced, and standard VAT rates based on country, category, and B2B status.",
  "frontend/src/hooks/useActor.ts": "React hook managing authenticated/anonymous actor creation using Internet Identity, with query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, sidebar, charts, etc.) and dropdown z-index fixes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/Invoice.tsx": "Invoice generation page component that manages invoice details (seller, buyer, line items, payment terms), calculates VAT totals, and provides PDF/XML export functionality with EN 16931 compliance.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page component showcasing Glotaxa features (multi-country VAT calculation, compliant invoices, instant calculations) with hero section and feature grid.",
  "frontend/src/pages/RegionSelect.tsx": "Country selection page displaying EU member states and UK as selectable regions for VAT calculation, organized in a card-based grid layout.",
  "frontend/src/pages/Transaction.tsx": "VAT calculation page where users input net amount and select category to calculate VAT, with real-time results display and option to generate invoice from transaction data.",
  "frontend/src/types/invoice.ts": "TypeScript type definitions for EN 16931 compliant invoice data structures including header, seller/buyer details, line items, payment terms, and complete invoice interface.",
  "frontend/src/utils/invoicePDF.ts": "Utility function to generate and download PDF invoices from Invoice16931 data, creating formatted HTML with invoice details, line items table, VAT breakdown, and payment terms.",
  "frontend/src/utils/invoiceXML.ts": "Generates EN16931-compliant UBL XML invoices from Invoice16931 objects, including seller/buyer details, line items, tax subtotals, payment terms, and proper XML escaping.",
  "frontend/src/utils/vatEngine.ts": "Empty file intended for VAT calculation engine logic.",
  "frontend/src/utils/vatLogicExplainer.ts": "Empty file intended for VAT logic explanation functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme with sidebar/chart colors, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for Glotaxa multi-country VAT calculator and invoice generator, documenting architectural decisions, known issues (VAT dropdown z-index problem), and completed features across 13 versions."
}